app/controllers/articles_controller.rb

SELECT * FROM "articles" WHERE ("articles"."id" = -1)
SELECT * FROM "comments" WHERE ("comments"."article_id" = 4) LIMIT 1
---
  def show
    @article = Article.find(params[:id])
    begin
      @prev = Article.find((params[:id].to_i-1).to_s)
    rescue
      @prev = @article
    end
    begin
      @next = Article.find((params[:id].to_i+1).to_s)
    rescue
      @next = @article
    end
    @article.views += 1
    @article.save

    unless params[:comment].nil? or params[:comment].empty?

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
SELECT * FROM "authors" WHERE ("authors"."id" = 1)
---
  def edit
    @article = Article.find(params[:id])
    @authors = Author.find(:all)

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
INSERT INTO "articles" ("created_at", "title", "body", "updated_at", "author_id") VALUES('2010-01-03 21:31:34', 'There once was a man from peru...', '..who dreamed he was eating his shoe. He woke in the night with a terrible fright to find that his dream had come true.', '2010-01-03 21:31:34', 1)
---
  def create
    @article = Article.new(params[:article])
    @article.author = Author.find(params[:author][:id])
    @article.category = Category.find(params[:category][:id])
    @articles.views = 0

    respond_to do |format|
      if @article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
UPDATE "articles" SET "updated_at" = '2009-12-30 14:32:55', "body" = 'Some text. Now I added some more text.' WHERE "id" = 1
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
DELETE FROM "articles" WHERE "id" = 1
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy