app/controllers/authors_controller.rb

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
---
  def show
    @author = Author.find(params[:id])

SELECT * FROM "authors" WHERE ("authors"."id" = 2)
---
  def edit
    @author = Author.find(params[:id])

INSERT INTO "authors" ("created_at", "updated_at", "lname", "fname") VALUES('2010-01-03 21:29:35', '2010-01-03 21:29:35', 'Benzer', 'Alec')
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
UPDATE "authors" SET "updated_at" = '2010-01-09 19:55:18', "fname" = 'Alec' WHERE "id" = 1
---
  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])