app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.build(params[:comment])
    @comment.name = "Anonymous" if @comment.name.empty? || @comment.name.nil?

    respond_to do |format|
      if @comment.save
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)
INSERT INTO "comments" ("name", "created_at", "body", "updated_at", "article_id") VALUES('Jim', '2010-01-24 21:01:49', 'This is a cool article.', '2010-01-24 21:01:49', 3)