app/controllers/searches_controller.rb

  def index
    @results = Article.find_with_ferret(params[:q], :limit => :all) if params[:q]
---
SELECT * FROM "articles" WHERE (articles.id in ('1','2'))